Agenda de programacion clockeada.                             [[file:~/py1local/fichaje.py][fichaje.py]]
#+BEGIN: clocktable :maxlevel 2 :scope file
#+CAPTION: Clock summary at [2016-10-29 sáb 13:09]
| Headline                                    | Time   |      |
|---------------------------------------------+--------+------|
| *Total time*                                | *5:22* |      |
|---------------------------------------------+--------+------|
| Tab pedidos                                 | 5:22   |      |
| \emsp haciendo subtab pasar clientes nuevos |        | 1:16 |
| \emsp bosquejamos el pasado de pedido       |        | 1:41 |
| \emsp agregando posibilidad de carga...     |        | 1:00 |
#+END:

* Tab pedidos                                                       :urgente:
CLOCK: [2016-10-25 mar 12:16]--[2016-10-25 mar 12:31] =>  0:15
CLOCK: [2016-10-24 lun 21:59]--[2016-10-24 lun 22:22] =>  0:23
CLOCK: [2016-10-24 lun 19:45]--[2016-10-24 lun 20:32] =>  0:47
** hice una subclase de Buscar que se llama BuscarConPadron
que hereda de Buscar y redefine el metodo show, para permitir filtrar
si el usuario ingreso un dni con prefijo f/F/m/M y busca en el padron
femenino o masculino el numero, y ello sin importar si el cliente ya
existe en Romitex. (cosa que no se podia en las busqueda
semiautomaticas de dni.tcl)
** Inicie el tab y puse el cuadro de Buscar en un frame
** Le agregue funcionalidad de busqueda por nombre pf'Filippi Ana'
*** ojo con el elif                                                 :pitfall:
agrego un branch mas a un if elif else y no actualizo bien. y queda 
if
if
elif
else
y produce errores raros, y es que el flujo va dos veces por un if que
pretende ser excluyente.
** Arregle toque final class Buscar/BuscarConPadron


Agregue o bien mejore y estableci el metodo colsel del tablelist que
te permite poner las columnas ya de entrada en la definicion del tbls
con el select que vamos a usar y no dejar que se cargue automaticamente.
** haciendo subtab pasar clientes nuevos
CLOCK: [2016-10-25 mar 19:01]--[2016-10-25 mar 19:15] =>  0:14
CLOCK: [2016-10-25 mar 13:06]--[2016-10-25 mar 13:30] =>  0:24
CLOCK: [2016-10-25 mar 13:47]--[2016-10-25 mar 14:25] =>  0:38
ya esta casi listo.  Falta corregir el metodo clear de los combos de
bwidget que no andan. para el boton limpiar. Lo hice asi separado, pq
en este pasador nuevo quiero seguir el zen de python explicito mejor
que implicito.
pasado de cliente nuevo en tab aparte, que quede ahi los datos hasta
qu expresamente los limpie, etc.
Era un bug en bwidget.py, ya lo arregle pero lo mismo no limpia.
** bosquejamos el pasado de pedido
CLOCK: [2016-10-29 sáb 11:29]--[2016-10-29 sáb 11:51] =>  0:22
CLOCK: [2016-10-29 sáb 11:17]--[2016-10-29 sáb 11:27] =>  0:10
CLOCK: [2016-10-28 vie 19:50]--[2016-10-28 vie 20:23] =>  0:33
dejo para despues cuando tenga mas concentracion.
Pasado de pedido: Encabezo el subtab con id y nombre del que compra y
luego vamos con los datos del pedido en si.
CLOCK: [2016-10-28 vie 11:51]--[2016-10-28 vie 12:27] =>  0:36
Done: Tanto buscando en el cuadro buscar como creando un cliente nuevo
se termina en subtab pedido con un encabezado en label rojo con el id
y nombre del cliente a procesar.
Inicio apenas el pedido.

bugs: class LabelFecha que ponga la fecha de hoy con . o h.
arreglar los tamaños de la linea.
Corregido. Estaban mal los nombres de los keysym era period y
KP_Decimal para punto y habia un error en delete(0,END,hasta) el hasta
estaba de mas.
Arreglado los tamaños a mano y agregado el campo de info seven, que
tendra que ser registrado en algun lado, lo cual no es malo, pq toda
esa data siempre se perdio y es muy relevante. .
** agregando posibilidad de carga general de datos
CLOCK: [2016-10-29 sáb 12:09]--[2016-10-29 sáb 13:09] =>  1:00
ya esta hecha la linea de datos, que funciona a nivel general. Me
trabo un bug o un pitfall de labelentry con el metodo set, que ya lo
he tenido, es decir cuando asigno mediante un bind un valor a un
labelentry se ponen unos signos raros en el campo lanzador del bind y
no surte efecto el bind, yo lo atribuia en principio a que andaba mal
el teclado fisico mio, pero aca lo probe con entrys sueltos o sea sin
label entry y anda joyita o sea que eso me plantea el tema de tener
que usar esos atajos que en principio parecieron ideales y que ahora
no lo son. pq en el caso de que tengo que usar un frame horizontal, es
rapidisimo incorporar los label sueltos y el ancho se calcula solo y
mejor.

